umangparekh/thread_apps/Thread-1.0.1/hal/micro/cortexm3/efm32/diagnostic.c
/*
 * File: hal/micro/cortexm3/diagnostic.c
 * Description: EM3XX-specific diagnostic HAL functions
 *
 * Author(s): 
 *
 * Copyright 2009 by Ember Corporation. All rights reserved.                *80*
 */

#include PLATFORM_HEADER
#include "stack/include/ember.h"
#include "hal/hal.h"
#include "em_device.h"
#include "em_gpio.h"
#include "serial/com.h"
#include "serial/serial.h"
#include "hal/micro/cortexm3/diagnostic.h"
#include "hal/micro/cortexm3/mpu.h"

#ifdef RTOS
  #include "rtos/rtos.h"
  #define freeRTOS 1
#else  // RTOS
  #define freeRTOS 0
  extern uint32_t* xTaskGetCurrentTaskStackTop(void);
  extern uint32_t* xTaskGetCurrentTaskStackBottom(void); 
#endif // RTOS

//------------------------------------------------------------------------------
// Preprocessor definitions

// Reserved instruction executed after a failed assert to cause a usage fault
#define ASSERT_USAGE_OPCODE 0xDE42

// Codes for DMA channels in DMA_PROT_CH
#define DMA_PROT_CH_SC1_RX    1
#define DMA_PROT_CH_GP_ADC    3
#define DMA_PROT_CH_MAC       4
#define DMA_PROT_CH_SC2_RX    5


//------------------------------------------------------------------------------
// Local Variables

static PGM_P PGM cfsrBits[] =
{

  // Memory management (MPU) faults 
  "IACCVIOL: attempted instruction fetch from a no-execute address",  // B0 
  "DACCVIOL: attempted load or store at an illegal address",          // B1
  "",                                                                 // B2
  "MUNSTKERR: unstack from exception return caused access violation", // B3
  "MSTKERR: stacking from exception caused access violation",         // B4
  "",                                                                 // B5
  "",                                                                 // B6
  "MMARVALID: MMAR contains valid fault address",                     // B7

  // Bus faults
  "IBUSERR: instruction prefetch caused bus fault",                   // B8
  "PRECISERR: precise data bus fault",                                // B9
  "IMPRECISERR: imprecise data bus fault",                            // B10
  "UNSTKERR: unstacking on exception return caused data bus fault",   // B11
  "STKERR: stacking on exception entry caused data bus fault",        // B12
  "",                                                                 // B13
  "",                                                                 // B14
  "BFARVALID: BFAR contains valid fault address",                     // B15

  // Usage faults
  "UNDEFINSTR: tried to execute an undefined instruction",            // B16
  "INVSTATE: invalid EPSR - e.g., tried to switch to ARM mode",       // B17
  "INVPC: exception return integrity checks failed",                  // B18
  "NOCP: attempted to execute a coprocessor instruction",             // B19
  "",                                                                 // B20
  "",                                                                 // B21
  "",                                                                 // B22
  "",                                                                 // B23
  "UNALIGNED: attempted an unaligned memory access",                  // B24
  "DIVBYZERO: attempted to execute SDIV or UDIV with divisor of 0"    // B25
};

static PGM_P PGM intActiveBits[] =
{
#ifdef _EZR32_LEOPARD_FAMILY
  "DMA",            // B0
  "GPIO_EVEN",      // B1
  "TIMER0",         // B2
  "USART0_RX",      // B3
  "USART0_TX",      // B4
  "USB",            // B5
  "ACMP0",          // B6
  "ADC0",           // B7
  "DAC0",           // B8
  "I2C0",           // B9
  "I2C1",           // B10
  "GPIO_ODD",       // B11
  "TIMER1",         // B12
  "TIMER2",         // B13
  "TIMER3",         // B14
  "USART1_RX",      // B15
  "USART1_TX",      // B16
  "LESENSE",        // B17
  "USART2_RX",      // B18
  "USART2_TX",      // B19
  "UART0_RX",       // B20
  "UART0_TX",       // B21
  "UART1_RX",       // B22
  "UART1_TX",       // B23
  "LEUART0",        // B24
  "LEUART1",        // B25
  "LETIMER0",       // B26
  "PCNT0",          // B27
  "PCNT1",          // B28
  "PCNT2",          // B29
  "RTC",            // B30
  "BURTC",          // B31
  "CMU",            // B32
  "VCMP",           // B33
  "LCD",            // B34
  "MSC",            // B35
  "AES",            // B36
  "EBI",            // B37
  "EMU",            // B38
#elif defined (_EFR_DEVICE)
  "EMU",              // B0
  "FRC_PRI",          // B1
  "FRC",              // B2
  "MODEM",            // B3
  "RAC_SEQ",          // B4
  "RAC_RSM",          // B5
  "BUFC",             // B6
  "LDMA",             // B7
  "GPIO_EVEN",        // B8
  "TIMER0",           // B9
  "USART0_RX",        // B10
  "USART0_TX",        // B11
  "ACMP0",            // B12
  "ADC0",             // B13
  "IDAC0",            // B14
  "I2C0",             // B15
  "GPIO_ODD",         // B16
  "TIMER1",           // B17
  "USART1_RX",        // B18
  "USART1_TX",        // B19
  "LEUART0",          // B20
  "PCNT0",            // B21
  "CMU",              // B22
  "MSC",              // B23
  "CRYPTO",           // B24
  "LETIMER0",         // B25
  "AGC",              // B26
  "PROTIMER",         // B27
  "RTCC",             // B28
  "SYNTH",            // B29
  "CRYOTIMER",        // B30
  "RFSENSE",          // B31
  "FPUEH",            // B32
  "WDOG",             // B33
#else
  "Timer1",       // B0
  "Timer2",       // B1
  "Management",   // B2
  "Baseband",     // B3
  "Sleep_Timer",  // B4
  "SC1",          // B5
  "SC2",          // B6
  "Security",     // B7
  "MAC_Timer",    // B8
  "MAC_TX",       // B9
  "MAC_RX",       // B10
  "ADC",          // B11
  "IRQ_A",        // B12
  "IRQ_B",        // B13
  "IRQ_C",        // B14
  "IRQ_D",        // B15
  "Debug"         // B16
#endif
};
// Names of raw crash data items - each name is null terminated, and the
// end of the array is flagged by two null bytes in a row.
// NOTE: the order of these names must match HalCrashInfoType members.
static const char nameStrings[] = "R0\0R1\0R2\0R3\0"
                                  "R4\0R5\0R6\0R7\0"
                                  "R8\0R9\0R10\0R11\0"
                                  "R12\0R13(LR)\0MSP\0PSP\0"
                                  "PC\0xPSR\0MSP used\0PSP used\0"
                                  "CSTACK bottom\0ICSR\0SHCSR\0INT_ACTIVE\0"
                                  "CFSR\0HFSR\0DFSR\0MMAR/BFAR\0AFSR\0"
                                  "Ret0\0Ret1\0Ret2\0Ret3\0"
                                  "Ret4\0Ret5\0Dat0\0Dat1\0";

//------------------------------------------------------------------------------
// Forward Declarations

//------------------------------------------------------------------------------
// Functions

static void halInternalAssertFault(PGM_P filename, int linenumber)
{
  // Cause a usage fault by executing a special UNDEFINED instruction.
  // The high byte (0xDE) is reserved to be undefined - the low byte (0x42)
  // is arbitrary and distiguishes a failed assert from other usage faults.
  // the fault handler with then decode this, grab the filename and linenumber
  // parameters from R0 and R1 and save the information for display after
  // a reset 
  asm("DC16 0DE42h");
}

// Stub for the EnergyMicro assert handler
void assertEFM(const char *file, int line)
{
  halInternalAssertFailed(file, line);
}

void halInternalAssertFailed(PGM_P filename, int linenumber)
{
  halResetWatchdog();              // In case we're close to running out.
  INTERRUPTS_OFF();

  #if DEBUG_LEVEL >= BASIC_DEBUG
    emberDebugAssert(filename, linenumber);
  #endif

  #if !defined(EMBER_ASSERT_OUTPUT_DISABLED)
    emberSerialGuaranteedPrintf(EMBER_ASSERT_SERIAL_PORT,
                                "\r\n[ASSERT:%p:%d]\r\n",
                                filename, 
                                linenumber);
  #endif
  
  #if defined (__ICCARM__)
    // With IAR, we can use the special fault mechanism to preserve more assert
    //  information for display after a crash
    halInternalAssertFault(filename, linenumber);
  #else
    // Other toolchains don't handle the inline assembly correctly, so
    // we just call the internal reset
    halResetInfo.crash.data.assertInfo.file =
        (const char *)halResetInfo.crash.R0;
    halResetInfo.crash.data.assertInfo.line = halResetInfo.crash.R1;
    halInternalSysReset(RESET_CRASH_ASSERT);
  #endif
}

// Returns the bytes used in the main stack area.
static uint32_t halInternalGetMainStackBytesUsed(uint32_t *p)
{
  for ( ; p < (uint32_t *)_CSTACK_SEGMENT_END; p++) {
    if (*p != STACK_FILL_VALUE) {
      break;
    }
  }
  return (uint32_t)((uint8_t *)_CSTACK_SEGMENT_END - (uint8_t *)p);
}

// After the low-level fault handler (in faults.s79) has saved the processor
// registers (R0-R12, LR and both MSP an PSP), it calls halInternalCrashHandler
// to finish saving additional crash data. This function returns the reason for
// the crash to the low-level fault handler that then calls 
// halInternalSystsemReset() to reset the processor.
//
// NOTE:
// This function should not use more than 16 words on the stack to avoid
// overwriting halResetInfo at the bottom of the stack segment.
// The 16 words include this function's return address, plus any stack
// used by functions called by this one. The stack size allowed is defined
// by the symbol CRASH_STACK_SIZE in faults.s79.
// As compiled by IAR V6.21.1, it now uses 8 words (1 for its return address,
// 6 for registers pushed onto the stack and 1 for the return address of
// halInternalGetMainStackBytesUsed().
//
uint16_t halInternalCrashHandler(void)
{
  uint32_t activeException;
  uint16_t reason = RESET_FAULT_UNKNOWN;
  HalCrashInfoType *c = &halResetInfo.crash;
  uint8_t i, j;
  uint32_t *sp, *s, *sEnd, *stackBottom, *stackTop; 
  uint32_t data;

  c->icsr.word = SCB->ICSR;
  c->shcsr.word = SCB->SHCSR;
#if defined (_EZR32_LEOPARD_FAMILY) || defined(_EFR_DEVICE)
  c->intActive.word[0] = NVIC->IABR[0];
  c->intActive.word[1] = NVIC->IABR[1];
#else
  c->intActive.word = NVIC->IABR[0];
#endif
  c->cfsr.word = SCB->CFSR;
  c->hfsr.word = SCB->HFSR;
  c->dfsr.word = SCB->DFSR;
  c->faultAddress = SCB->MMFAR;
  c->afsr.word = SCB->AFSR;

  // Examine B2 of the saved LR to know the stack in use when the fault occurred 
  sp = (uint32_t *)((c->LR & 4) ? c->processSP : c->mainSP);
  sEnd = sp; // Keep a copy around for walking the stack later

  // Get the bottom of the stack since we allow stack resizing
  c->mainStackBottom = (uint32_t)halInternalGetCStackBottom();

  // If we're running FreeRTOS and this is a process stack then add
  // extra diagnostic information
  if(freeRTOS && (c->LR & 4)) {
    // FreeRTOS doesn't provide the diagnostic functions we need
    // so for now just lie to get some diagnostics
    // stackBottom = (uint32_t*)xTaskGetCurrentTaskStackBottom();
    // stackTop = (uint32_t*)xTaskGetCurrentTaskStackTop();
    stackBottom = sp;
    stackTop = sp + 8;
    c->processSPUsed = stackTop - sp;
  } else {    
    stackBottom = (uint32_t*)c->mainStackBottom;
    stackTop = (uint32_t*)_CSTACK_SEGMENT_END;
    c->processSPUsed = 0;   // process stack not in use
  }

  // If the stack pointer is valid, read and save the stacked PC and xPSR
  if ( (sp >= stackBottom)
       && (sp <= (stackTop - 8)) ) { 
    sp += 6; // Skip over R0,R1,R2,R3,R12,LR
    c->PC = *sp++;
    c->xPSR.word = *sp++;
   
    // See if fault was due to a failed assert. This is indicated by 
    // a usage fault caused by executing a reserved instruction.
   if ( c->icsr.bits.VECTACTIVE == USAGE_FAULT_VECTOR_INDEX &&
        ((void *)c->PC >= (void*)_TEXT_SEGMENT_BEGIN) && 
        ((void *)c->PC < (void*)_TEXT_SEGMENT_END) &&
        *(uint16_t *)(c->PC) == ASSERT_USAGE_OPCODE ) {
      // Copy halInternalAssertFailed() arguments into data member specific
      // to asserts.
      c->data.assertInfo.file = (const char *)c->R0;
      c->data.assertInfo.line = c->R1;
#ifdef PUSH_REGS_BEFORE_ASSERT
      // Just before calling halInternalAssertFailed(), R0, R1, R2 and LR were
      // pushed onto the stack - copy these values into the crash data struct.
      c->R0 = *sp++;
      c->R1 = *sp++;
      c->R2 = *sp++;
      c->LR = *sp++;
#endif
      reason = RESET_CRASH_ASSERT;
    }
  // If a bad stack pointer, PC and xPSR to 0 to indicate they are not known.
  } else {
    c->PC = 0;
    c->xPSR.word = 0;
    sEnd = stackBottom;
  }

  // Fault handler has already started filling in halResetInfo{}
  // prior to calling this routine, so want to make sure _not_
  // to include halResetInfo in the stack assessment when crashing
  // to avoid a self-fulfilling prophesy of a full stack!  BugzId:13403
  uint32_t safeStackBottom = c->mainStackBottom;
  if (safeStackBottom < (uint32_t) _RESETINFO_SEGMENT_END) {
    safeStackBottom = (uint32_t) _RESETINFO_SEGMENT_END;
  }
  c->mainSPUsed = halInternalGetMainStackBytesUsed((uint32_t*)safeStackBottom);

  for (i = 0; i < NUM_RETURNS; i++) {
    c->returns[i] = 0;
  }

  // Search the stack downward for probable return addresses. A probable
  // return address is a value in the CODE segment that also has bit 0 set
  // (since we're in Thumb mode).
  for (i = 0, s = stackTop; s > sEnd; ) {
    data = *(--s);
    if ( ((void *)data >= (void*)_TEXT_SEGMENT_BEGIN) && 
         ((void *)data < (void*)_TEXT_SEGMENT_END) &&
         (data & 1) ) {
      // Only record the first occurrence of a return - other copies could
      // have been in registers that then were pushed.
      for (j = 0; j < NUM_RETURNS; j++) {
        if (c->returns[j] == data) {
            break;
        }
      }
      if (j != NUM_RETURNS) {
        continue;
      }
      // Save the return in the returns array managed as a circular buffer.
      // This keeps only the last NUM_RETURNS in the event that there are more.
      i = i ? i-1 : NUM_RETURNS - 1;          
      c->returns[i] = data;
    }
  }
  // Shuffle the returns array so returns[0] has last probable return found.
  // If there were fewer than NUM_RETURNS, unused entries will contain zero.
  while (i--) {
    data = c->returns[0];
    for (j = 0; j < NUM_RETURNS - 1; j++ ) {
      c->returns[j] = c->returns[j+1];
    }
    c->returns[NUM_RETURNS - 1] = data;
  }

  // Read the highest priority active exception to get reason for fault
  activeException = c->icsr.bits.VECTACTIVE;
  switch (activeException) {
  // case NMI_VECTOR_INDEX:
  //   if (INT_NMIFLAG_REG & INT_NMICLK24M_MASK) {
  //     reason = RESET_FATAL_CRYSTAL;
  //   } else if (INT_NMIFLAG_REG & INT_NMIWDOG_MASK) {
  //     reason = RESET_WATCHDOG_CAUGHT;
  //   }
  //   break;
  case HARD_FAULT_VECTOR_INDEX:
    reason = RESET_FAULT_HARD;
    break;
  case MEMORY_FAULT_VECTOR_INDEX:
    reason = RESET_FAULT_MEM;
    break;
  case BUS_FAULT_VECTOR_INDEX:
    reason = RESET_FAULT_BUS;
    break;
  case USAGE_FAULT_VECTOR_INDEX:
    // make sure we didn't already identify the usage fault as an assert
    if (reason == RESET_FAULT_UNKNOWN) {
      reason = RESET_FAULT_USAGE;
    }
    break;
  case DEBUG_MONITOR_VECTOR_INDEX:
    reason = RESET_FAULT_DBGMON;
    break;
  default:
    if (activeException && (activeException < VECTOR_TABLE_LENGTH) ) {
      reason = RESET_FAULT_BADVECTOR;
    }
    break;
  }
  return reason;
}

void halPrintCrashSummary(uint8_t port)
{
  HalCrashInfoType *c = &halResetInfo.crash;
  uint32_t sp, stackBegin, stackEnd, size, used;
  uint16_t pct;
  uint8_t *mode;
  const char *stack;
  uint8_t bit;

  if (c->LR & 4) {
    stack = "process";
    sp = c->processSP;
    used = c->processSPUsed;
    stackBegin = 0;
    stackEnd = 0;
  } else {
    stack = "main";
    sp = c->mainSP;
    used = c->mainSPUsed;
    stackBegin = (uint32_t)c->mainStackBottom;
    stackEnd = (uint32_t)_CSTACK_SEGMENT_END;
  }

  mode = (uint8_t *)((c->LR & 8) ? "Thread" : "Handler");
  size = stackEnd - stackBegin;
  pct = size ? (uint16_t)( ((100 * used) + (size / 2)) / size) : 0;
  emberSerialPrintfLine(port, "%p mode using %p stack (%4x to %4x), SP = %4x",
                        mode, stack, stackBegin, stackEnd, sp);
  emberSerialPrintfLine(port, "%u bytes used (%u%%) in %p stack"
                        " (out of %u bytes total)", 
                        (uint16_t)used, pct, stack, (uint16_t)size);
  if ( !(c->LR & 4) && (used == size - 4*RESETINFO_WORDS)
       && (c->mainStackBottom < (uint32_t) _RESETINFO_SEGMENT_END) ) {
    // Here the stack overlaps the RESETINFO region and when we checked
    // stack usage we avoided checking that region because we'd already
    // started using it -- so if we found the stack almost full to that
    // point, warn that it might actually have been completely full.
    emberSerialPrintfLine(port, "Stack _may_ have used up to 100%% of total.");
  }
  // Valid SP range is [stackBegin, stackEnd] inclusive, but contents
  // of stack only go into [stackBegin, stackend).
  if ((sp > stackEnd) || (sp < stackBegin)) {
    emberSerialPrintfLine(port, "SP is outside %p stack range!", stack);
  } 
  emberSerialWaitSend(port);

#if defined(_EZR32_LEOPARD_FAMILY) || defined(_EFR_DEVICE)
  if (c->intActive.word[0]) {
    emberSerialPrintf(port, "Interrupts active (or pre-empted and stacked):");
    for (bit = 0; bit < 32; bit++) {
      if ( (c->intActive.word[0] & (1 << bit)) && *intActiveBits[bit] ) {
        emberSerialPrintf(port, " %p", intActiveBits[bit]);
      }
    }
    emberSerialPrintCarriageReturn(port);
  } 
  if (c->intActive.word[1]) {
    emberSerialPrintf(port, "Interrupts active (or pre-empted and stacked):");
#ifdef _EZR32_LEOPARD_FAMILY
    for (bit = 0; bit < EMU_IRQn-32; bit++) {
#elif defined (_EFR_DEVICE)
    for (bit = 0; bit < FPUEH_IRQn-32; bit++) {
#endif
      if ( (c->intActive.word[1] & (1 << bit)) && *intActiveBits[bit] ) {
        emberSerialPrintf(port, " %p", intActiveBits[bit]);
      }
    }
    emberSerialPrintCarriageReturn(port);
  } 

#else
  if (c->intActive.word) {
    emberSerialPrintf(port, "Interrupts active (or pre-empted and stacked):");
    for (bit = INT_TIM1_BIT; bit <= INT_DEBUG_BIT; bit++) {
      if ( (c->intActive.word & (1 << bit)) && *intActiveBits[bit] ) {
        emberSerialPrintf(port, " %p", intActiveBits[bit]);
      }
    }
    emberSerialPrintCarriageReturn(port);
  } 
#endif
  else 
  {
    emberSerialPrintfLine(port, "No interrupts active");
  }
}

void halPrintCrashDetails(uint8_t port)
{
  HalCrashInfoType *c = &halResetInfo.crash;
  uint16_t reason = halGetExtendedResetInfo();
  uint8_t bit;

  switch (reason) {

  case RESET_WATCHDOG_EXPIRED:
    emberSerialPrintfLine(port, "Reset cause: Watchdog expired, no reliable extra information");
    emberSerialWaitSend(port);
    break;
  case RESET_WATCHDOG_CAUGHT:
    emberSerialPrintfLine(port, "Reset cause: Watchdog caught with enhanced info");
    emberSerialPrintfLine(port, "Instruction address: %4x", c->PC);
    emberSerialWaitSend(port);
    break;

  case RESET_CRASH_ASSERT:
    emberSerialPrintfLine(port, "Reset cause: Assert %p:%d",
          c->data.assertInfo.file, c->data.assertInfo.line);
    emberSerialWaitSend(port);
    break;

  case RESET_FAULT_HARD:
    emberSerialPrintfLine(port, "Reset cause: Hard Fault");
    if (c->hfsr.bits.VECTTBL) {
      emberSerialPrintfLine(port, 
              "HFSR.VECTTBL: error reading vector table for an exception");
    }
    if (c->hfsr.bits.FORCED) {
      emberSerialPrintfLine(port, 
              "HFSR.FORCED: configurable fault could not activate");
    }
    if (c->hfsr.bits.DEBUGEVT) {
      emberSerialPrintfLine(port, 
              "HFSR.DEBUGEVT: fault related to debug - e.g., executed BKPT");
    }
    emberSerialWaitSend(port);
    break;

  case RESET_FAULT_MEM:
    emberSerialPrintfLine(port, "Reset cause: Memory Management Fault");
    if (c->cfsr.bits.DACCVIOL || c->cfsr.bits.IACCVIOL) 
    {
      emberSerialPrintfLine(port, "Instruction address: %4x", c->PC);
    }
    if (c->cfsr.bits.MMARVALID) 
    {
      emberSerialPrintfLine(port, "Illegal access address: %4x", c->faultAddress);
    }
    for (bit = SCB_CFSR_MEMFAULTSR_Pos; bit < (SCB_CFSR_MEMFAULTSR_Pos+8); bit++) {
      if ( (c->cfsr.word & (1 << bit)) && *cfsrBits[bit] ) {
        emberSerialPrintfLine(port, "CFSR.%p", cfsrBits[bit]);
      }
    }
    emberSerialWaitSend(port);
    break;

  case RESET_FAULT_BUS:
    emberSerialPrintfLine(port, "Reset cause: Bus Fault");
    emberSerialPrintfLine(port, "Instruction address: %4x", c->PC);
    if (c->cfsr.bits.IMPRECISERR) {
      emberSerialPrintfLine(port, 
        "Address is of an instruction after bus fault occurred, not the cause.");
    }
    if (c->cfsr.bits.BFARVALID) {
      emberSerialPrintfLine(port, "Illegal access address: %4x", 
                            c->faultAddress);
    }
    for (bit = SCB_CFSR_BUSFAULTSR_Pos; bit < SCB_CFSR_USGFAULTSR_Pos; bit++) {
      if ( (c->cfsr.word & (1 << bit)) && *cfsrBits[bit] ) {
        emberSerialPrintfLine(port, "CFSR.%p", cfsrBits[bit]);
      }
    }
    if ( (c->cfsr.word & 0xFF) == 0) {
      emberSerialPrintfLine(port, "CFSR.(none) load or store at an illegal address");      
    }
    emberSerialWaitSend(port);
    break;

  case RESET_FAULT_USAGE:
    emberSerialPrintfLine(port, "Reset cause: Usage Fault");
    emberSerialPrintfLine(port, "Instruction address: %4x", c->PC);
    for (bit = SCB_CFSR_USGFAULTSR_Pos; bit < 32; bit++) {
      if ( (c->cfsr.word & (1 << bit)) && *cfsrBits[bit] ) {
        emberSerialPrintfLine(port, "CFSR.%p", cfsrBits[bit]);
      }
    }
    emberSerialWaitSend(port);
    break;

  case RESET_FAULT_DBGMON:
    emberSerialPrintfLine(port, "Reset cause: Debug Monitor Fault");
    emberSerialPrintfLine(port, "Instruction address: %4x", c->PC);
    emberSerialWaitSend(port);
    break;

  default:
    break;
  }
}

// Output an array of 32 bit values, 4 per line, each preceded by its name.
void halPrintCrashData(uint8_t port)
{
  uint32_t *data = (uint32_t *)&halResetInfo.crash.R0;
  char const *name = nameStrings;
  char const *separator;
  uint8_t i;

  for (i = 0; *name; i++) {
    emberSerialPrintf(port, "%p = %4x", name, *data++);
    while (*name++) {}  // intentionally empty while loop body
    /*lint -save -e448 */
    separator = (*name && ((i & 3) != 3) ) ? ", " : "\r\n";
    /*lint -restore */ 
    emberSerialPrintf(port, separator);
    emberSerialWaitSend(port);
  }
}

uint16_t halGetPCDiagnostics( void )
{
  return 0;
}

void halStartPCDiagnostics( void )
{
}

void halStopPCDiagnostics( void )
{
}
